$(document).on("click","a[href]", function(){
    document.getElementById("starHeader").textContent = this.dataset.name;    
    if(this.dataset.name == "الشمس"){
        document.getElementById("starDetails").innerHTML = `الشمس هي نجم ضخم ساطع في مركز نظامنا الشمسي، تُشكل 99.86% من كتلة النظام. تُعد مصدر الضوء والحرارة الأساسي على كوكب الأرض، وتدعم الحياة بفضل طاقتها الهائلة.
        <img src="images/sun.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">خصائص الشمس:</h1>
        <br>
        <br>

        <p dir="rtl">
        <b>الحجم:</b> قطرها 1,392,684 كيلومتر، أي 109 ضعف قطر الأرض.
        <br>
        <b>الكتلة:</b> 333,000 ضعف كتلة الأرض.
        <br>
        <b>السطح:</b> حار جداً، تصل حرارته إلى 5,500 درجة مئوية.
        <br>
        <b>التكوين:</b> تتكون بشكل أساسي من الهيدروجين والهيليوم، مع كميات قليلة من العناصر الأخرى.
        <br>
        <b>العمر:</b> 4.6 مليار سنة.
        <br>
        <b>المستقبل:</b> ستتحول الشمس إلى عملاق أحمر بعد حوالي 5 مليارات سنة، ثم إلى قزم أبيض بعد ذلك بمليارات السنين.
        </p>

        <br>
        <br>
        <h1 dir="rtl">تأثير الشمس على الأرض:</h1>
        <br>
        <br>
        
        <p dir="rtl">
        <b>الضوء:</b> تُنير الشمس الأرض وتمنحها النهار.
        <br>
        <b>الحرارة:</b> تُدفئ الشمس الأرض وتُساعد على تنظيم مناخها.
        <br>
        <b>الطاقة:</b> تُستخدم طاقة الشمس لتوليد الكهرباء، ودفع المركبات، وغيرها من الاستخدامات.
        <br>
        <b>الحياة:</b> تُعد الشمس ضرورية للحياة على الأرض، حيث تدعم عملية التمثيل الضوئي للنباتات، وتُؤثر على سلوك الحيوانات، وتُساعد على دورة الحياة.
        </p>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/IUc3Y5mwV10?si=Dr3n4SVSlV8fKX8z"></iframe>
        `;
    }else if(this.dataset.name == "عطارد"){
        document.getElementById("starDetails").innerHTML = `عطارد هو أصغر كواكب المجموعة الشمسية وأقربها إلى الشمس. يتميز بسطحه المليء بالحفر، وغيابه شبه الدائم عن الأنظار بسبب قربه من الشمس.
        <img src="images/mercury.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">خصائص فريدة:</h1>
        <br>
        <br>

        <p dir="rtl">
        <b>أسرع كوكب:</b> يدور عطارد حول الشمس بسرعة 180,000 كيلومتر في الساعة، مما يجعله أسرع كوكب في المجموعة الشمسية.
        <br>
        <b>نهارات حارقة وليالي باردة:</b> يتعرض عطارد لدرجات حرارة هائلة من الشمس تصل إلى 430 درجة مئوية نهاراً، بينما تنخفض ليلاً إلى -180 درجة مئوية.
        <br>
        <b>غياب الغلاف الجوي:</b> يفتقر عطارد إلى غلاف جوي كثيف، مما يجعله عرضة للاصطدامات بالكويكبات والمذنبات، ويسبب تباينًا كبيرًا في درجات الحرارة.
        <br>
        <b>سنة قصيرة:</b> يكمل عطارد دورة كاملة حول الشمس كل 88 يومًا أرضيًا.
        <br>
        <b>مجال مغناطيسي ضعيف:</b> يمتلك عطارد مجالًا مغناطيسيًا ضعيفًا للغاية مقارنةً بالأرض.
        </p>

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة للاهتمام:</h1>
        <br>
        <br>
        
        <p dir="rtl">
        سمي عطارد على اسم إله السرعة عند الرومان.
        <br>
        لا يمتلك عطارد أقمارًا.
        <br>
        تم زيارة عطارد من قبل مركبتين فضائيتين فقط، هما مارينر 10 و MESSENGER.
        <br>
        يمكن رؤية عطارد بالعين المجردة في سماء الفجر أو المساء، لكن ذلك صعب بسبب قربه من الشمس.
        </p>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/m4EDv9nJ1aI?si=q-jf2u2ajb2Pie_R"></iframe>
        `;
    }else if(this.dataset.name == "الزهرة"){
        document.getElementById("starDetails").innerHTML = `كوكب الزهرة: توأم الأرض المُضلل
        <img src="images/venus.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">الوصف:</h1>
        <br>
        <br>

        <p dir="rtl">
        ثاني كواكب المجموعة الشمسية بُعدًا عن الشمس.
        <br>
        يُلقب بـ توأم الأرض لِتشابهه في الحجم والتركيب.
        <br>
        أقرب كوكب للأرض.
        <br>
        يُرى من الأرض قبل شروق الشمس أو بعد غروبها.
        <br>
        يتميز بِغلافه الجوي الكثيف المُكوّن من ثاني أكسيد الكربون وغازات أخرى.
        <br>
        سطحه حارّ جدًّا (حوالي 462 درجة مئوية) ويُغطّيه براكين نشطة.
        <br>
        لا يملك مجالًا مغناطيسيًا.
        <br>
        يدور باتجاه مُعاكس لباقي كواكب المجموعة الشمسية.
        <br>
        لا يملك أقمارًا.
        </p>

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة للاهتمام:</h1>
        <br>
        <br>
        
        <p dir="rtl">
        يُعدّ أكثر كواكب المجموعة الشمسية سطوعًا.
        <br>
        أُرسلت العديد من المركبات الفضائية لاستكشافه.
        <br>
        لا يُمكن الحياة على سطحه بسبب الظروف القاسية.
        </p>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/VdC4Z-2abHE?si=SxCuqdf16_5PINVw"></iframe>
        `;
    }else if(this.dataset.name == "الأرض"){
        document.getElementById("starDetails").innerHTML = `كوكب الأرض: واحة الحياة في الفضاء
        <img src="images/earth.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">الكوكب الأزرق:</h1>
        <p> يُعد كوكب الأرض ثالث كواكب المجموعة الشمسية بعدًا عن الشمس، وهو الكوكب الوحيد المعروف حتى الآن الذي يُمكن أن تسكنه الكائنات الحية. يتميز كوكبنا بخصائص فريدة تُميزه عن باقي كواكب المجموعة الشمسية، أهمها:</p>
        <br>
        <br>

        <p dir="rtl">
        وجود الماء السائل: يُغطي الماء حوالي 71% من سطح الأرض، وهو ضروري لِحياة جميع الكائنات الحية.
        <br>
        الغلاف الجوي: يُحيط بالأرض غلاف جوي غني بالأكسجين، وهو ضروري للتنفس.
        <br>
        درجة الحرارة المناسبة: تقع درجة حرارة الأرض ضمن نطاق يسمح بوجود الماء السائل على سطحها.
        <br>
        المجال المغناطيسي: يُحمي المجال المغناطيسي الأرض من الإشعاعات الضارة القادمة من الشمس.
        <br>
        التنوع البيولوجي: تُعد الأرض موطنًا لملايين الأنواع من الكائنات الحية، من البكتيريا الدقيقة إلى الأشجار الضخمة.
        </p>

        <br>
        <br>
        
        <p dir="rtl">كوكب نابض بالحياة: على الرغم من صغر حجمه نسبيًا، إلا أن كوكب الأرض يتمتع بتنوع هائل في المناخات والتضاريس، من قمم الجبال الشاهقة إلى الغابات المطيرة الكثيفة، ومن الصحاري القاحلة إلى المحيطات الشاسعة.</p>
        <br>
        <br>
        <p dir="rtl">مستقبل غامض: يواجه كوكب الأرض العديد من التحديات، مثل تغير المناخ والتلوث، مما يُهدد مستقبل الحياة عليه.</p>
        <br>
        <br>
        <p dir="rtl">مسؤولية مشتركة: حماية كوكب الأرض مسؤولية تقع على عاتق جميع سكانه، وذلك من خلال اتباع ممارسات مستدامة تُقلل من تأثيرنا على البيئة.</p>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/u_gHPZ20qJw?si=6oWiclYru5pjGNod"></iframe>
        `;
    }else if(this.dataset.name == "المريخ"){
        document.getElementById("starDetails").innerHTML = `المريخ، أو الكوكب الأحمر، هو رابع كوكب من حيث البعد عن الشمس في نظامنا الشمسي. يتميز بلونه الأحمر الداكن بسبب وجود أكسيد الحديد (الصّدأ) على سطحه.
        <img src="images/mars.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق سريعة عن المريخ:</h1>
        <p>
        الحجم: أصغر من الأرض بقليل.
        <br>
        السطح: صخري مع براكين خامدة وأخاديد وسهول شاسعة.
        <br>
        الأقمار: قمران صغيران هما فوبوس و ديموس.
        <br>
        الغلاف الجوي: رقيق للغاية يتكون في الغالب من ثاني أكسيد الكربون.
        <br>
        الطقس: بارد وجاف مع عواصف ترابية متكررة.
        <br>
        الماء: يُعتقد بوجوده في صورة جليد في القطبين وربما تحت السطح.
        <br>
        الاستكشاف: تم إرسال العديد من المركبات الفضائية إلى المريخ لدراسته، بما في ذلك مركبات الهبوط والرحلات الاستكشافية.
        </p>
        <br>
        <br>

        <br>
        <br>
        <h1 dir="rtl">لماذا المريخ مهم؟</h1>
        <br>
        <br>
        
        <p dir="rtl">
        يُعد المريخ أقرب كوكب إلى الأرض يشبه كوكبنا، مما يجعله هدفًا رئيسيًا لبحوث الفضاء.
        <br>
        يُعتقد أن المريخ كان في الماضي صالحًا للحياة، مما يثير تساؤلات حول إمكانية وجود حياة على الكواكب الأخرى.
        <br>
        يُعد استكشاف المريخ خطوة مهمة في فهم تاريخ نظامنا الشمسي وبحثًا عن إمكانية وجود حياة خارج كوكب الأرض.
        </p>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/VdC4Z-2abHE?si=0_pf9m8iZeWemdJh"></iframe>
        `;
    }else if(this.dataset.name == "المشتري"){
        document.getElementById("starDetails").innerHTML = `المشتري، Jupiter بالإنجليزية، هو أضخم كواكب المجموعة الشمسية، حيث يبلغ قطره 11 ضعف قطر الأرض. يُعرف كونه عملاق غازي، يتكون بشكل أساسي من الهيدروجين والهيليوم. يتميز المشتري بغلافه الجوي الملون، حيث تظهر فيه بقع بنية وحمراء عملاقة ناتجة عن عواصف هائلة.
        <img src="images/jupiter.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن المشتري:</h1>
        <p>
        أسرع كوكب في دورانه: يدور المشتري حول نفسه مرة كل 10 ساعات.
        <br>
        يملك أقوى مجال مغناطيسي: أقوى من مجال الأرض 20 ألف مرة.
        <br>
        له بقعة حمراء عملاقة: عاصفة هائلة أكبر من الأرض تدوم منذ قرون.
        <br>
        يُسمى "حامي الأرض": يُعتقد أنه منع العديد من المذنبات والكويكبات من الاصطدام بالأرض.
        </p>
        <br>
        <br>
        
        <p dir="rtl">
        يتميز المشتري أيضاً بعدد هائل من الأقمار، حيث يبلغ عددها 79 قمرًا، أشهرها أوروبا وغانيميد وكاليستو وآيو.
        </p>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/8e94yHURkVI?si=_ZvmAfgqwTr5dkcn"></iframe>
        `;
    }else if(this.dataset.name == "زحل"){
        document.getElementById("starDetails").innerHTML = `زحل، سادس كواكب المجموعة الشمسية، يتميز بجمالٍ فريد يجعله أيقونةً سماويةً لا مثيل لها.
        <img src="images/saturn.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن زحل:</h1>
        <p>
        الحلقات: تُحيط بزحل حلقاتٌ ضخمةٌ من الجليد والغبار، تجعله أشبه بعجلةٍ سماويةٍ تدور في الفضاء.
        <br>
        الغاز العملاق: يتكون زحل بشكلٍ أساسي من الهيدروجين والهيليوم، ممّا يجعله كوكبًا غازيًا عملاقًا.
        <br>
        العواصف الهائجة: تُعرف عواصف زحل بضخامتها وشدتها، حيث تصل سرعة رياحها إلى أكثر من 1600 كيلومتر في الساعة.
        <br>
        الأقمار العديدة: يمتلك زحل 82 قمرًا، أشهرها تيتان، الذي يُعدّ أكبر قمرٍ في المجموعة الشمسية.
        <br>
        عالمٌ بارد: على الرغم من كونه كوكبًا غازيًا، إلّا أنّ زحل باردٌ جدًا، حيث تبلغ متوسط درجات الحرارة على سطحه حوالي -140 درجة مئوية.
        </p>
        <br>
        <br>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/HsJ10ooe_4E?si=PNsvVDlaZygAuoCy"></iframe>
        `;
    }else if(this.dataset.name == "اورانوس"){
        document.getElementById("starDetails").innerHTML = `أورانوس، سابع كواكب المجموعة الشمسية، يتميز بخصائص فريدة تجعله مختلفًا عن باقي إخوته
        <img src="images/uranus.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن اورانوس:</h1>
        <p>
        لون أخضر مزرق: غلافه الجوي غني بالميثان، الذي يعكس الضوء الأحمر ويسمح بمرور الضوء الأزرق والأخضر، مما يمنحه لونه المميز.
        <br>
        ميلان غريب: يدور أورانوس حول نفسه بزاوية 98 درجة، مما يعني أن قطبيه الشمالي والجنوبي يميلان بشكل كبير نحو مسار شمسه.
        <br>
        أبرد كوكب: يتمتع أورانوس بأدنى درجة حرارة بين جميع الكواكب، حيث تصل إلى -224 درجة مئوية.
        <br>
        حلقات معقدة: يمتلك أورانوس نظامًا من الحلقات الرقيقة الداكنة، تتكون من غبار وجليد.
        <br>
        أقمار غريبة: 27 قمرًا يدورون حول أورانوس، بعضها يدور في اتجاه عكسي لاتجاه دوران الكوكب.
        </p>
        <br>
        <br>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/ey-iar8hBGA?si=TZ2gz7Yvci5lWFX9"></iframe>
        `;
    }else if(this.dataset.name == "نبتون"){
        document.getElementById("starDetails").innerHTML = `نبتون، ثامن كواكب المجموعة الشمسية وأبعدها عن الشمس، كوكب غازي عملاق يتميز بلونه الأزرق الجليدي.وهو يتميز بخصائص فريدة تجعله مميزًا بين كواكب المجموعة الشمسية:
        <img src="images/neptune.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن كوكب نبتون:</h1>
        <p>
        أبعد كوكب: يدور نبتون حول الشمس على بعد هائل يبلغ حوالي 4.5 مليار كيلومتر، أي ما يعادل 30.1 وحدة فلكية.
        <br>
        لون أزرق: يُضفي وجود الميثان في غلافه الجوي لونه الأزرق المميز.
        <br>
        عواصف عملاقة: تُعرف نبتون بوجود عاصفة عملاقة تسمى "البقعة الداكنة الكبيرة" استمرت لأكثر من عقدين.
        <br>
        رياح قوية: تُعدّ رياح نبتون أسرع الرياح في المجموعة الشمسية، حيث تصل سرعتها إلى 2000 كيلومتر في الساعة.
        <br>
        أقمار: لنبتون 14 قمرًا معروفًا، أشهرها تريتون الذي يتميز بدورانه عكس اتجاه دوران نبتون.
        <br>
        حلقة ضعيفة: يُحيط بنبتون حلقة خافتة من الغبار والجسيمات الدقيقة يصعب رؤيتها.
        <br>
        يستغرق نبتون 165 سنة أرضية لإكمال دورة واحدة حول الشمس.
        <br>
        يُعدّ نبتون أبرد كوكب في المجموعة الشمسية، حيث تبلغ درجة حرارته حوالي -218 درجة مئوية.
        <br>
        اكتشف نبتون عام 1846 بفضل حسابات رياضية دقيقة قبل رصده
        </p>
        <br>
        <br>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/ey-iar8hBGA?si=TZ2gz7Yvci5lWFX9"></iframe>
        `;
    }else if(this.dataset.name == "الشعرى اليمانية"){
        document.getElementById("starDetails").innerHTML = `نجم الشعرى اليمانية:
        <img src="images/sirius.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن نجم الشعرى اليمانية:</h1>
        <p>
        ألمع نجم في سماء الليل: يُعدّ نجم الشعرى اليمانية، أو "ألفا الكلب الأكبر" كما يُعرف علمياً، ألمع نجمٍ قابلٍ للرؤية بالعين المجردة في سماء الليل، متجاوزاً حتى سطوع الشمس والقمر.
        <br>
        قرب نسبي من الأرض: يقع نجم الشعرى اليمانية على بعد 8.6 سنة ضوئية من الأرض، ما يجعله أحد أقرب النجوم إلينا.
        <br>
        نظام نجمي ثنائي: يتكون نجم الشعرى اليمانية من نجمين:
        <br>
        الشعرى اليمانية أ: نجم عملاق أبيض ساخن يشكل 98% من كتلة النظام.
        <br>
        الشعرى اليمانية ب: قزم أبيض كثيف يدور حول الشعرى اليمانية أ كل 49 عاماً.
        <br>
        تاريخ عريق: حظي نجم الشعرى اليمانية بأهمية كبيرة في العديد من الحضارات القديمة، حيث ارتبط بظواهر طبيعية مثل الفيضانات وارتباطه بمجموعة نجوم الكلب الأكبر.
        <br>
        يُطلق على نجم الشعرى اليمانية اسم "أبرق" في اللغة العربية.
        <br>
        يُمكن رؤيته بسهولة في نصف الكرة الشمالي خلال فصل الشتاء.
        <br>
        لعب نجم الشعرى اليمانية دورًا هامًا في الملاحة البحرية قديماً.
        </p>
        <br>
        <br>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/WPhSLFppdLI?si=GYZ4rqNHQBRLDe8I"></iframe>
        `;
    }else if(this.dataset.name == "الذنب الأكبر"){
        document.getElementById("starDetails").innerHTML = `نجم الذنب الأكبر (Canopus) :
        <img src="images/canopus.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن نجم الذنب الأكبر:</h1>
        <p>
        أحد ألمع النجوم في سماء الليل، يقع في كوكبة الكلب الأكبر.
        <br>
        ثاني ألمع نجم بعد نجم الشعرى اليمانية (Sirius).
        <br>
        يمكن رؤيته بسهولة في نصف الكرة الجنوبي، بينما يمكن رؤيته بصعوبة في نصف الكرة الشمالي.
        <br>
        له أهمية تاريخية وثقافية كبيرة، حيث كان يستخدمه البحارة في الملاحة قديماً.
        <br>
        يُعتقد أنه نجم عملاق أبيض ضخم، أكبر من الشمس بحوالي 10 أضعاف.
        <br>
        يبعد عن الأرض حوالي 310 سنة ضوئية.
        <br>
        يُطلق على نجم الذنب الأكبر أيضاً اسم "سهيل" في بعض الثقافات العربية.
        <br>
        يُعد نجم الذنب الأكبر أحد النجوم المُفضلة لدى العديد من الفلكيين ومحبي رصد النجوم.
        </p>
        <br>
        <br>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/85GtlpHHKs4?si=4QNZUEwNJT3H_8nA"></iframe>
        `;
    }else if(this.dataset.name == "العيوق"){
        document.getElementById("starDetails").innerHTML = `نجم العيوق:
        <img src="images/arcturus.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن نجم العيوق:</h1>
        <p>
        الاسم: العيوق (Capella)
        <br>
        الموقع: كوكبة ممسك الأعنة (Auriga)
        <br>
        القدر الظاهري: 0.97 (أحد ألمع النجوم في السماء)
        <br>
        المسافة: 42.9 سنة ضوئية
        <br>
        النوع الطيفي: G0 III
        <br>
        الخصائص:
        <br>
        نجم عملاق أصفر
        <br>
        يتكون من نجمين ثنائيين
        <br>
        يظهر بلون مائل إلى الأصفر أو البرتقالي
        <br>
        سهل الرصد بالعين المجردة
        <br>
        يُعد العيوق أحد أقدم النجوم في كوكبة ممسك الأعنة.
        <br>
        كان يُستخدم من قبل البحارة العرب لتنظيم رحلاتهم.
        <br>
        يُعتقد أن اسمه مشتق من الكلمة العربية "العَوْق" التي تعني "المنع".
        </p>
        <br>
        <br>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/8a57YbVZk0A?si=9FeSm4k3ggR2XiGz"></iframe>
        `;
    }else if(this.dataset.name == "النسر الواقع"){
        document.getElementById("starDetails").innerHTML = `نجم النسر الواقع:
        <img src="images/vega.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن النسر الواقع:</h1>
        <p>
        ألمع نجم في كوكبة القيثارة: يُعرف أيضًا باسم "الأثافي".
        <br>
        خامس ألمع نجم في سماء الليل: يضيء بشكلٍ لافتٍ للنظر.
        <br>
        نجم قريب نسبيًا: يبعد حوالي 25 سنة ضوئية عن الأرض.
        <br>
        نجم شاب: يبلغ عمره حوالي 450 مليون سنة، أي حوالي عُشر عمر الشمس.
        <br>
        نجم ضخم: يفوق كتلة الشمس بحوالي 2.1 مرة.
        <br>
        نجم ساخن: تبلغ درجة حرارة سطحه حوالي 9,930 درجة مئوية.
        <br>
        نجم يدور بسرعة: يدور حول محوره بسرعة 242 كيلومترًا في الثانية.
        <br>
        نجم له قرص حطام: يُعتقد أنه بقايا نظام شمسي ناشئ.
        <br>
        كان النسر الواقع في الماضي نجم الشمال، وسوف يعود كذلك مرة أخرى بعد حوالي 12 ألف عام.
        <br>
        يُستخدم النسر الواقع كمعيار لقياس سطوع النجوم الأخرى.
        <br>
        يُعتقد أن بعض الحضارات القديمة قد عبدت النسر الواقع.
        </p>
        <br>
        <br>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/k6nmYL8kExI?si=1uSZTQ7606SzupQw"></iframe>
        `;
    }else if(this.dataset.name == "رجل الجبار"){
        document.getElementById("starDetails").innerHTML = `رجل الجبار، أو بيتا الجبار (Beta Orionis) بالإنجليزية، هو ألمع نجم في كوكبة الجبار، وسادس أكثر النجوم لمعانًا في سماء الليل. يتميز بلونه الأزرق الساطع، وهو نجم عملاق عظيم، أي أنه أكبر بكثير وأكثر سطوعًا من الشمس.
        <img src="images/rigel.png" width="100%">

        <br>
        <br>
        <h1 dir="rtl">حقائق مثيرة عن النسر الواقع:</h1>
        <p>
        الكتلة: 17 ضعف كتلة الشمس
        <br>
        اللمعان: 40,000 ضعف لمعان الشمس
        <br>
        المسافة: 773 سنة ضوئية من الأرض
        <br>
        الحجم: 79 ضعف قطر الشمس
        <br>
        العمر: حوالي 8 ملايين سنة
        <br>
        المصير: سينفجر كمستعر أعظم
        <br>
        يمكن ملاحظة رجل الجبار بسهولة في سماء الليل، خاصة خلال فصل الشتاء. يقع في الجزء الجنوبي الغربي من كوكبة الجبار، ويشكل مع نجمين آخرين حزام الجبار المميز.
        </p>
        <br>
        <br>
        <hr>
        <iframe height="450" width="100%" src="https://www.youtube.com/embed/ka3bDgFCYS0?si=uaxPgYqgxv-8YNfs"></iframe>
        `;
    }

    $(".stars-container").css({opacity:0,marginTop:"-30px"});
    setTimeout(function(){
        $(".stars-container").css({display:"none"});
    },200);
    setTimeout(function(){
        $(".star-details").css({display:"block"});
        setTimeout(function(){
            $(".star-details").css({opacity:1,marginTop:"0px"});
        },1);
    },1000);
});